[
    {
        "id": 1,
        "rating": 5,
        "name": "Bobby Alvarez",
        "designation": "CEO, Amazon",
        "image": "https://randomuser.me/api/portraits/men/17.jpg",
        "review": "GPU Point warehouse is an amazing institution. They are always quick to respond and address any issues that may arise. I was really impressed by the inventory they have on hand, as well as their prices. My order shipped the same day, which was more than I had expected and arriving quickly without any problems"
    },
    {
        "id": 2,
        "rating": 4.9,
        "name": "Byron Wade",
        "designation": "Manager, Alexa inc",
        "image": "https://randomuser.me/api/portraits/men/82.jpg",
        "review": "I ordered a GPU from this company because they had the best price, and it's been perfect for me so far. I would highly recommend buying from them as well!"
    },
    {
        "id": 3,
        "rating": 5,
        "name": "Bob Day",
        "designation": "CTO, Mailchimp",
        "image": "https://randomuser.me/api/portraits/men/81.jpg",
        "review": "I can't wait to see GPU Point's new warehouse! They've been needing a new one for quite some time now. I don't know when it will be ready, but I'm hoping that it happens soon...I'm sure it will be great!"
    },
    {
        "id": 4,
        "rating": 4.2,
        "name": "Hunter Castro",
        "designation": "CEO, Hubspot",
        "image": "https://randomuser.me/api/portraits/men/71.jpg",
        "review": "When I first saw the GPU Point warehouse I was a little disappointed. It's not as big as I expected and the selection is kind of limited. But then I realized it's just like any other Walmart or Target, but dedicated to GPUs and gaming stuff. Luckily, they had what I needed - no need to go anywhere else!"
    },
    {
        "id": 5,
        "rating": 5,
        "name": "Dylan Kelly",
        "designation": "CEO, Amazon",
        "image": "https://randomuser.me/api/portraits/men/88.jpg",
        "review": "I have been buying my electronics from this warehouse for over a year now and I can't find a single flaw with them. I've never had an experience with GPU Point that wasn't the best! The customer service is phenomenal, the products are always high quality, and it's easy to get what you need when you order from them. I would highly recommend to anyone looking"
    }, 
    {
        "id": 6,
        "rating": 5,
        "name": "Norman Beck",
        "designation": "Marketer, NEO agency",
        "image": "https://randomuser.me/api/portraits/men/40.jpg",
        "review": "Brilliant. That's the perfect way to describe GPUPoint.com. They have a warehouse of GPUs and high-end computer parts for all sorts of gamers, builders, and developers. I love their fast service and stellar customer service. GPU Point is my go-to company for all of my gaming needs!"
    },
    {
        "id": 7,
        "rating": 4.8,
        "name": "Bill Robinson",
        "designation": "CTO, Virtual Life",
        "image": "https://randomuser.me/api/portraits/men/41.jpg",
        "review": "GPU Point warehouse is a really great place to buy GPUs. I couldn't find any other store that offered the same high quality or wide selection. If you're looking for a GPU and live in the U.S., then this is the place to go!"
    },
    
    {
        "id": 8,
        "rating": 4.7,
        "name": "Tim Nelson",
        "designation": "Researcher, Nasa",
        "image": "https://randomuser.me/api/portraits/men/67.jpg",
        "review": "I've been shopping at the GPU Point warehouse for over a year now. It's a one-stop shop for all of my office needs, and I'm always impressed by the new products that they have. My favorite things to order are the monitors, they have the best prices in town. And I always choose next day delivery when I need it- their service is top"
    },
    {
        "id": 9,
        "rating": 5,
        "name": "Jim Graves",
        "designation": "CEO, Google",
        "image": "https://randomuser.me/api/portraits/men/34.jpg",
        "review": "GPU Point warehouse is one of the warehouses that I have worked with and can say that they are outstanding. The warehouse is clean, well-organized, and has excellent security. I am always confident that my inventory will be safe while it's on their property and am glad to know there are plenty of dock doors available for when it's time to unload."
    }
    

]